metaneutrons/Vellum/firmware/components-epaper/epaper_uc8179/examples/esp32_wroom_generic/sdkconfig.defaults
# ESP32 target
CONFIG_IDF_TARGET="esp32"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# No PSRAM required (works with or without)
# CONFIG_ESP32_SPIRAM_SUPPORT is not set

# Stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
